In [1]:
import pandas as pd
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')

In [4]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [5]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [6]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [7]:
#For determining Nan in column
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [8]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [9]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [10]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [11]:
len(X_train)

712

In [12]:
len(X_test)

179

In [13]:
len(inputs)

891

In [14]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [15]:
model.fit(X_train,y_train)

GaussianNB()

In [16]:
model.score(X_test,y_test)

0.7821229050279329

In [17]:
X_test[:10]

     Pclass        Age     Fare  female  male
135       2  23.000000  15.0458       0     1
347       3  29.699118  16.1000       1     0
190       2  32.000000  13.0000       1     0
491       3  21.000000   7.2500       0     1
4         3  35.000000   8.0500       0     1
271       3  25.000000   0.0000       0     1
412       1  33.000000  90.0000       1     0
149       2  42.000000  13.0000       0     1
707       1  42.000000  26.2875       0     1
363       3  35.000000   7.0500       0     1

In [18]:
y_test[:10]

135    0
347    1
190    1
491    0
4      0
271    1
412    1
149    0
707    1
363    0
Name: Survived, dtype: int64

In [19]:
model.predict(X_test[:10])

array([0, 1, 1, 0, 0, 0, 1, 0, 0, 0], dtype=int64)

In [20]:
model.predict_proba(X_test[:10])

array([[0.97639346, 0.02360654],
       [0.06085357, 0.93914643],
       [0.03106929, 0.96893071],
       [0.98783207, 0.01216793],
       [0.99001764, 0.00998236],
       [0.98801819, 0.01198181],
       [0.00140503, 0.99859497],
       [0.98062774, 0.01937226],
       [0.93631996, 0.06368004],
       [0.98996877, 0.01003123]])

In [21]:
import pickle
filename = 'finalized_nbmodel.sav'
pickle.dump(model, open(filename, 'wb'))
loaded_model = pickle.load(open(filename, 'rb'))
result = loaded_model.score(X_test, y_test)
print(result)

0.7821229050279329